1C/src/InformationRegisters/КХ_НастройкиПодключения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КХ_НастройкиПодключения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АдресСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПутьККомпоненте</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1C/src/CommonModules/КХ_ИнтеграцияСлужебный/Ext/Module.bsl
// Получает параметры подключения к ClickHouse из регистра сведений.
// Возвращает настройки из первой найденной записи регистра.
//
// Возвращаемое значение:
//  Структура - Контейнер с настройками подключения:
//   * АдресСервера    - Строка - URL или IP-адрес сервера.
//   * Пользователь    - Строка - Логин для авторизации.
//   * Пароль          - Строка - Пароль для авторизации.
//   * ПутьККомпоненте - Строка - Путь к внешней компоненте на диске.
//
Функция ПолучитьНастройкиИзРегистра() Экспорт
	Результат = Новый Структура("АдресСервера, Пользователь, Пароль, ПутьККомпоненте", "", "", "", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст=
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КХ_НастройкиПодключения.АдресСервера КАК АдресСервера,
		|	КХ_НастройкиПодключения.Пользователь КАК Пользователь,
		|	КХ_НастройкиПодключения.Пароль КАК Пароль,
		|	КХ_НастройкиПодключения.ПутьККомпоненте КАК ПутьККомпоненте
		|ИЗ
		|	РегистрСведений.КХ_НастройкиПодключения КАК КХ_НастройкиПодключения";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	Возврат Результат;
КонецФункции
// Удаляет из строки нулевые байты (символы с кодом 0).
// Используется для очистки бинарных данных перед конвертацией в текст.
//
// Параметры:
//  ВходящаяСтрока - Строка - Исходная строка для очистки.
//
// Возвращаемое значение:
//  Строка - Очищенная строка без нулевых символов.
//
Функция ОчиститьСтрокуОтНулей(Знач ВходящаяСтрока) Экспорт
	Если Не ЗначениеЗаполнено(ВходящаяСтрока) Тогда
		Возврат ВходящаяСтрока;
	КонецЕсли;
	
	Если Прав(ВходящаяСтрока, 1) = Символ(0) Тогда
		Возврат Лев(ВходящаяСтрока, СтрДлина(ВходящаяСтрока) - 1);
	КонецЕсли;
	
	Возврат ВходящаяСтрока;
КонецФункции
// Преобразует сырой текстовый ответ от ClickHouse в объект 1С (Структура или Соответствие).
// Перед парсингом автоматически удаляет из текста нулевые символы.
//
// Параметры:
//  СыройОтвет - Строка - Полученный от сервера ответ в формате JSON.
//
// Возвращаемое значение:
//  Произвольный - Структура, Соответствие или Массив, полученные в результате десериализации JSON.
//
Функция РаспарситьОтветClickHouse(Знач СыройОтвет) Экспорт
	
	ЧистыйJSON = ОчиститьСтрокуОтНулей(СыройОтвет);
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ЧистыйJSON);
	Результат = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Возврат Результат;
	
КонецФункции
